//1


int main ()
{

    #define PI 3.14 //Задаємо константу ПІ

    float l, v, s;
    char command = 'l'; //Обираємо дію
    float r = 6.0; //Задаємо радіус
    float result;
    if (command == 'l'){ //Якщо команда l
        result = 2.0 * PI * r;
    }
    else if (command == 's'){ //Якщо команда s
        result = PI * r * r;
    }
    else if (command == 'v'){ //Якщо команда v
         result = (4.0 * PI * r * r * r)/3.0;
    }



//2


	#define NUM 123.987 //Задаємо число

	int part1 = NUM; //Виводимо цілу частину
	float part2 = (NUM - part1) * 1000; //Виводимо дробову частину

	float diff = (part2 / part1); //Знаходимо частку
	diff *= 100; //Зводимо частку до 2 знаків після коми наступними командами
	diff = (int)diff;
	diff /= 100;


//3


	int k = 3; //Вводимо змінну k
	int m = 2; //Вводимо змінну m
	int n = 1; //Вводимо змінну n
	int x = 0; //Вводимо змінну x

	if ( m < k ){ //Якщо m < k то
		x = k; //x набуває значення k
		k = m; //k набуває значення m
		m = x; //m набувеє значення x
	}
	if ( n < m ){ //Якщо n < m то
		x = n; //x набуває значення n
		n = m; //n набуває значення m
		m = x; //m набуває значення x
	}
	if ( m < k ){ //Якщо m < k то
		x = k; //x набуває значення k
		k = m; //k набуває значення m
		m = x; //m набуває значення x
        }

//4


	#define X1 -1.5 //Вводимо значення Х1

	float y = 0; //Задаємо змінну У

	if ( X1 < -1 ){ //Якщо Х < -1 то
		y = -1 / X1;
	}
	else if ( X1 >= -1 && X1 <= 1 ){ //Якщо Х >= -1 та <= 1 то
		y = X1 * X1;
	}
	else{ //В інших випадках
		y = 1;
	}


//5


	#define X2 -0.5 //Задаємо значення X
	float y1 = 0; //Вводимо змінну y

	if ( X2 > 1 ){ //Якщо Х > 1 то
		y1 = X2 - 1;
	}
	else if ( X2 >= 0 && X2 <= 1 ){ //Якщо Х >= 0 та <= 1 то
		y1 = - X2 + 1;
	}
	else if ( X2 > -1 && X2 < 0 ){ //Якщо Х > -1 та < 0 то
		y1 = X2 + 1;
	}
	else if ( X2 < -1 ){ //Якщо Х < -1 то
		y1 = - X2 - 1;
	}
	return 0;
}
